<a href="https://colab.research.google.com/github/Vyshnavi2k5/PDS_B14_2303A51968/blob/main/Pandas_for_series%2C_data_frames_and_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

#Creating a series from a list
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

print("Pandas Series:")
print(series)

Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

Series with Custom Index

In [2]:
import pandas as pd

data = [10, 20, 30, 40, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']

series = pd.Series(data, index=index_labels)

print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

Creating a DataFrame

In [3]:
import pandas as pd

#Creating a DataFrame from a dictionary
data={
    'Name':['Alice','Bob','Claire','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad', 'Delhi', 'Chennai','Mumbai']
}

df=pd.DataFrame(data)

print("Pandas DataFrame:")
print(df)

Pandas DataFrame:
     Name  Age       City
0   Alice   25  Hyderabad
1     Bob   30      Delhi
2  Claire   35    Chennai
3   David   40     Mumbai

Basic DataFrame Operations
(a)Accessing Data

In [4]:
#Access a single column
print(df['Name'])

#Access multiple columns
print(df[['Name','City']])

#Access rows using index
print(df.iloc[1]) #row at index 1
print(df.loc[2]) #row with label 2

0     Alice
1       Bob
2    Claire
3     David
Name: Name, dtype: object
     Name       City
0   Alice  Hyderabad
1     Bob      Delhi
2  Claire    Chennai
3   David     Mumbai
Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object
Name     Claire
Age          35
City    Chennai
Name: 2, dtype: object

(b) Adding a New Column

In [5]:
df['Salary'] = [40000, 50000, 60000, 70000]
print(df)

     Name  Age       City  Salary
0   Alice   25  Hyderabad   40000
1     Bob   30      Delhi   50000
2  Claire   35    Chennai   60000
3   David   40     Mumbai   70000

c)Removing a Column

In [6]:
df=df.drop('City', axis=1)
print(df)

     Name  Age  Salary
0   Alice   25   40000
1     Bob   30   50000
2  Claire   35   60000
3   David   40   70000

d) Filtering Data

In [7]:
# Select rows where Age > 30
print(df[df['Age']>30])

     Name  Age  Salary
2  Claire   35   60000
3   David   40   70000

e) Basic Statistics

In [8]:
from collections.abc import AsyncGenerator
print(df['Age'].mean()) #Average age
print(df['Age'].max()) #Maximum age
print(df['Age'].min()) #Minimum age

32.5
40
25

Real-World Example: Student Data

In [11]:
import pandas as pd

#Create a DataFrame with student details
student_data = {
    'StudentID':[101, 102, 103, 104],
    'Name':['Ravi','Neha','Kiran','Sita'],
    'Marks':[85, 90, 78, 92],
    'Department':['CSE', 'ECE', 'MECH', 'CSE']
}

df=pd.DataFrame(student_data)

#Display full DataFrame
print("Student Data:")
print(df)

#Find students with marks>80
print("\nStudents with Marks>80:")
print(df[df['Marks']>80])

#Average marks
print("\nAverage Marks:",df['Marks'].mean())

#Add new column
df['Result']=['Pass' if x>=40 else 'Fail' for x in df['Marks']]
print("\nWith Result Column:")
print(df)

Student Data:
   StudentID   Name  Marks Department
0        101   Ravi     85        CSE
1        102   Neha     90        ECE
2        103  Kiran     78       MECH
3        104   Sita     92        CSE

Students with Marks>80:
   StudentID  Name  Marks Department
0        101  Ravi     85        CSE
1        102  Neha     90        ECE
3        104  Sita     92        CSE

Average Marks: 86.25

With Result Column:
   StudentID   Name  Marks Department Result
0        101   Ravi     85        CSE   Pass
1        102   Neha     90        ECE   Pass
2        103  Kiran     78       MECH   Pass
3        104   Sita     92        CSE   Pass

Excel Sheet

In [17]:
import pandas as pd
student_data = {"S.No.":[1, 2, 3, 4, 5],
        "Student_ID":[1968, 1685, 2266, 2263, 1234],
        "Student_Name":["vyshnavi", "siri", "jyoti", "pallavi", "hiranmai"],
        "M1":[92, 14, 81, 89, 51],
        "M2":[74, 56, 81, 90, 24],
        "M3":[52, 39, 78, 94, 67],
}
df=pd.DataFrame(student_data)
df['total']=df['M1']+df['M2']+df['M3']
df['Avg']=df['total']/3
df['result']=['Pass' if x>=40 else 'Fail' for x in df['Avg']]
print("Student Data with Results:")
print(df)

Student Data with Results:
   S.No.  Student_ID Student_Name  M1  M2  M3  total        Avg result
0      1        1968     vyshnavi  92  74  52    218  72.666667   Pass
1      2        1685         siri  14  56  39    109  36.333333   Fail
2      3        2266        jyoti  81  81  78    240  80.000000   Pass
3      4        2263      pallavi  89  90  94    273  91.000000   Pass
4      5        1234     hiranmai  51  24  67    142  47.333333   Pass